src/pages/guilda-ia/_arquivadas/03b-python-intermediario.org
#+TITLE: Python Intermediário: Além do Básico
# Semana 5 - 08/05/2026
#+DESCRIPTION: Semana 5 - Guilda de IA: Python intermediário para agentes de IA
#+SETUPFILE: ../setupfile.org
#+LANGUAGE: pt_BR
#+STARTUP: inlineimages showall latexpreview
#+DATE: 08/05/2026

* Semana 4 - Python Intermediário

* Por que continuar com Python?

Na semana anterior, vimos o mínimo necessário para usar APIs de LLM. Agora vamos além:

1. *Estruturas de dados mais complexas*
2. *Classes e orientação a objetos*
3. *Tratamento de erros robusto*
4. *Organização de código*

Esses conceitos são fundamentais para construir agentes mais sofisticados.

* Estruturas de Dados Avançadas

** Comprehensions

Forma concisa de criar listas, dicionários e sets.

#+BEGIN_SRC python
# List comprehension
numeros = [1, 2, 3, 4, 5]
quadrados = [n ** 2 for n in numeros]  # [1, 4, 9, 16, 25]

# Com condição
pares = [n for n in numeros if n % 2 == 0]  # [2, 4]

# Dict comprehension
palavras = ["gato", "cachorro", "pássaro"]
tamanhos = {p: len(p) for p in palavras}  # {"gato": 4, "cachorro": 8, ...}
#+END_SRC

** Generators

Funções que produzem valores sob demanda, economizando memória.

#+BEGIN_SRC python
# Generator function
def contar_ate(n):
    for i in range(n):
        yield i

# Uso
for num in contar_ate(5):
    print(num)  # 0, 1, 2, 3, 4

# Generator expression
quadrados_gen = (n ** 2 for n in range(1000000))  # Não cria lista na memória
#+END_SRC

** Quando usar Generator vs Lista

| Situação                | Use Lista          | Use Generator      |
|-------------------------+--------------------+--------------------|
| Precisa acessar múltiplas vezes | ✓ | ✗ |
| Precisa de len() ou indexação | ✓ | ✗ |
| Grande volume de dados | ✗ | ✓ |
| Pipeline de processamento | ✗ | ✓ |

* Orientação a Objetos

** Classes Básicas

#+BEGIN_SRC python
class Agente:
    """Representa um agente de IA com memória."""
    
    def __init__(self, nome: str, sistema: str = "Você é um assistente."):
        """
        Inicializa o agente.
        
        Args:
            nome: Nome identificador do agente
            sistema: System prompt do agente
        """
        self.nome = nome
        self.sistema = sistema
        self.historico = []
    
    def conversar(self, mensagem: str) -> str:
        """Processa uma mensagem e retorna resposta."""
        self.historico.append({"role": "user", "content": mensagem})
        # ... lógica de processamento ...
        resposta = f"[{self.nome}] Resposta simulada"
        self.historico.append({"role": "assistant", "content": resposta})
        return resposta
    
    def limpar_memoria(self) -> None:
        """Limpa o histórico de conversa."""
        self.historico = []
        return "Memória limpa"
    
    def __repr__(self) -> str:
        return f"Agente(nome='{self.nome}', mensagens={len(self.historico)})"


# Uso
agente = Agente("Assistente", "Você é um tutor de Python.")
print(agente.conversar("Olá!"))  # [Assistente] Resposta simulada
print(agente)  # Agente(nome='Assistente', mensagens=2)
#+END_SRC

