pages/guilda-ia/_arquivadas/03b-python-intermediario.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Intermediário: Além do Básico</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Semana 5 - Guilda de IA: Python intermediário para agentes de IA
Material didático do curso de IA Generativa da Guilda de IA" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/pages/guilda-ia/03b-python-intermediario.html">
<meta property="og:type" content="website">
<meta property="og:title" content="Python Intermediário: Além do Básico">
<meta property="og:description" content="Semana 5 - Guilda de IA: Python intermediário para agentes de IA
Material didático do curso de IA Generativa da Guilda de IA">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/pages/guilda-ia/03b-python-intermediario.html">
<meta name="twitter:title" content="Python Intermediário: Além do Básico">
<meta name="twitter:description" content="Semana 5 - Guilda de IA: Python intermediário para agentes de IA
Material didático do curso de IA Generativa da Guilda de IA">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Python Intermediário: Além do Básico</h1>
</div>
<div id="content" class="content">
<div id="outline-container-org8eb473e" class="outline-2">
<h2 id="org8eb473e">Semana 4 - Python Intermediário</h2>
</div>

<div id="outline-container-org9d56012" class="outline-2">
<h2 id="org9d56012">Por que continuar com Python?</h2>
<div class="outline-text-2" id="text-org9d56012">
<p>
Na semana anterior, vimos o mínimo necessário para usar APIs de LLM. Agora vamos além:
</p>

<ol class="org-ol">
<li><b>Estruturas de dados mais complexas</b></li>
<li><b>Classes e orientação a objetos</b></li>
<li><b>Tratamento de erros robusto</b></li>
<li><b>Organização de código</b></li>
</ol>

<p>
Esses conceitos são fundamentais para construir agentes mais sofisticados.
</p>
</div>
</div>
<div id="outline-container-orga73d4f8" class="outline-2">
<h2 id="orga73d4f8">Estruturas de Dados Avançadas</h2>
<div class="outline-text-2" id="text-orga73d4f8">
</div>
<div id="outline-container-orgb2372e0" class="outline-3">
<h3 id="orgb2372e0">Comprehensions</h3>
<div class="outline-text-3" id="text-orgb2372e0">
<p>
Forma concisa de criar listas, dicionários e sets.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">List comprehension
</span><span class="org-variable-name">numeros</span> <span class="org-operator">=</span> [1, 2, 3, 4, 5]
<span class="org-variable-name">quadrados</span> <span class="org-operator">=</span> [n <span class="org-operator">**</span> 2 <span class="org-keyword">for</span> n <span class="org-keyword">in</span> numeros]  <span class="org-comment-delimiter"># </span><span class="org-comment">[1, 4, 9, 16, 25]
</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Com condi&#231;&#227;o
</span><span class="org-variable-name">pares</span> <span class="org-operator">=</span> [n <span class="org-keyword">for</span> n <span class="org-keyword">in</span> numeros <span class="org-keyword">if</span> n <span class="org-operator">%</span> 2 <span class="org-operator">==</span> 0]  <span class="org-comment-delimiter"># </span><span class="org-comment">[2, 4]
</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Dict comprehension
</span><span class="org-variable-name">palavras</span> <span class="org-operator">=</span> [<span class="org-string">"gato"</span>, <span class="org-string">"cachorro"</span>, <span class="org-string">"p&#225;ssaro"</span>]
<span class="org-variable-name">tamanhos</span> <span class="org-operator">=</span> {p: <span class="org-builtin">len</span>(p) <span class="org-keyword">for</span> p <span class="org-keyword">in</span> palavras}  <span class="org-comment-delimiter"># </span><span class="org-comment">{"gato": 4, "cachorro": 8, ...}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org23e4cf1" class="outline-3">
<h3 id="org23e4cf1">Generators</h3>
<div class="outline-text-3" id="text-org23e4cf1">
<p>
Funções que produzem valores sob demanda, economizando memória.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Generator function
</span><span class="org-keyword">def</span> <span class="org-function-name">contar_ate</span>(n):
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n):
        <span class="org-keyword">yield</span> i

<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-keyword">for</span> num <span class="org-keyword">in</span> contar_ate(5):
    <span class="org-builtin">print</span>(num)  <span class="org-comment-delimiter"># </span><span class="org-comment">0, 1, 2, 3, 4
</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Generator expression
</span><span class="org-variable-name">quadrados_gen</span> <span class="org-operator">=</span> (n <span class="org-operator">**</span> 2 <span class="org-keyword">for</span> n <span class="org-keyword">in</span> <span class="org-builtin">range</span>(1000000))  <span class="org-comment-delimiter"># </span><span class="org-comment">N&#227;o cria lista na mem&#243;ria</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgddd1259" class="outline-3">
<h3 id="orgddd1259">Quando usar Generator vs Lista</h3>
<div class="outline-text-3" id="text-orgddd1259">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Situação</th>
<th scope="col" class="org-left">Use Lista</th>
<th scope="col" class="org-left">Use Generator</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Precisa acessar múltiplas vezes</td>
<td class="org-left">✓</td>
<td class="org-left">✗</td>
</tr>

<tr>
<td class="org-left">Precisa de len() ou indexação</td>
<td class="org-left">✓</td>
<td class="org-left">✗</td>
</tr>

<tr>
<td class="org-left">Grande volume de dados</td>
<td class="org-left">✗</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">Pipeline de processamento</td>
<td class="org-left">✗</td>
<td class="org-left">✓</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgc437472" class="outline-2">
<h2 id="orgc437472">Orientação a Objetos</h2>
<div class="outline-text-2" id="text-orgc437472">
</div>
<div id="outline-container-orgcf5a8d2" class="outline-3">
<h3 id="orgcf5a8d2">Classes Básicas</h3>
<div class="outline-text-3" id="text-orgcf5a8d2">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Agente</span>:
    <span class="org-doc">"""Representa um agente de IA com mem&#243;ria."""</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, nome: <span class="org-builtin">str</span>, sistema: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">"Voc&#234; &#233; um assistente."</span>):
        <span class="org-doc">"""
        Inicializa o agente.

        Args:
            nome: Nome identificador do agente
            sistema: System prompt do agente
        """</span>
        <span class="org-keyword">self</span>.<span class="org-variable-name">nome</span> <span class="org-operator">=</span> nome
        <span class="org-keyword">self</span>.<span class="org-variable-name">sistema</span> <span class="org-operator">=</span> sistema
        <span class="org-keyword">self</span>.<span class="org-variable-name">historico</span> <span class="org-operator">=</span> []

    <span class="org-keyword">def</span> <span class="org-function-name">conversar</span>(<span class="org-keyword">self</span>, mensagem: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
        <span class="org-doc">"""Processa uma mensagem e retorna resposta."""</span>
        <span class="org-keyword">self</span>.historico.append({<span class="org-string">"role"</span>: <span class="org-string">"user"</span>, <span class="org-string">"content"</span>: mensagem})
        <span class="org-comment-delimiter"># </span><span class="org-comment">... l&#243;gica de processamento ...
</span>        <span class="org-variable-name">resposta</span> <span class="org-operator">=</span> f<span class="org-string">"[</span>{<span class="org-keyword">self</span>.nome}<span class="org-string">] Resposta simulada"</span>
        <span class="org-keyword">self</span>.historico.append({<span class="org-string">"role"</span>: <span class="org-string">"assistant"</span>, <span class="org-string">"content"</span>: resposta})
        <span class="org-keyword">return</span> resposta

    <span class="org-keyword">def</span> <span class="org-function-name">limpar_memoria</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> <span class="org-constant">None</span>:
        <span class="org-doc">"""Limpa o hist&#243;rico de conversa."""</span>
        <span class="org-keyword">self</span>.<span class="org-variable-name">historico</span> <span class="org-operator">=</span> []
        <span class="org-keyword">return</span> <span class="org-string">"Mem&#243;ria limpa"</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__repr__</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
        <span class="org-keyword">return</span> f<span class="org-string">"Agente(nome='</span>{<span class="org-keyword">self</span>.nome}<span class="org-string">', mensagens=</span>{<span class="org-builtin">len</span>(<span class="org-keyword">self</span>.historico)}<span class="org-string">)"</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-variable-name">agente</span> <span class="org-operator">=</span> Agente(<span class="org-string">"Assistente"</span>, <span class="org-string">"Voc&#234; &#233; um tutor de Python."</span>)
<span class="org-builtin">print</span>(agente.conversar(<span class="org-string">"Ol&#225;!"</span>))  <span class="org-comment-delimiter"># </span><span class="org-comment">[Assistente] Resposta simulada
</span><span class="org-builtin">print</span>(agente)  <span class="org-comment-delimiter"># </span><span class="org-comment">Agente(nome='Assistente', mensagens=2)</span>
</pre>
</div>
</div>
</div>
