src/pages/guilda-ia/_arquivadas/03b-python-intermediario.org
** Herança

#+BEGIN_SRC python
class AgenteComFerramentas(Agente):
    """Agente que pode usar ferramentas externas."""
    
    def __init__(self, nome: str, sistema: str = "Você é um assistente.", ferramentas: dict = None):
        super().__init__(nome, sistema)
        self.ferramentas = ferramentas or {}
    
    def adicionar_ferramenta(self, nome: str, funcao: callable) -> None:
        """Registra uma nova ferramenta."""
        self.ferramentas[nome] = funcao
    
    def usar_ferramenta(self, nome: str, *args, **kwargs):
        """Executa uma ferramenta pelo nome."""
        if nome not in self.ferramentas:
            raise ValueError(f"Ferramenta '{nome}' não encontrada")
        return self.ferramentas[nome](*args, **kwargs)


# Uso
def calculadora(expr: str):
    return eval(expr)  # Simplificado - não usar em produção!

agente = AgenteComFerramentas("Calc", ferramentas={"calc": calculadora})
print(agente.usar_ferramenta("calc", "2 + 2"))  # 4
#+END_SRC

** @property e Encapsulamento

#+BEGIN_SRC python
class AgenteProtegido:
    def __init__(self, nome: str):
        self._nome = nome  # "Privado" por convenção
        self.__historico = []  # Name-mangled (mais privado)
    
    @property
    def nome(self) -> str:
        """Getter para nome."""
        return self._nome
    
    @nome.setter
    def nome(self, valor: str) -> None:
        """Setter com validação."""
        if not valor.strip():
            raise ValueError("Nome não pode ser vazio")
        self._nome = valor
    
    @property
    def total_mensagens(self) -> int:
        """Propriedade calculada."""
        return len(self.__historico)
#+END_SRC

* Tratamento de Erros Robusto

** Hierarquia de Exceções

#+BEGIN_SRC python
# Exceções embutidas comuns
try:
    resultado = fazer_algo()
except ValueError as e:
    print(f"Valor inválido: {e}")
except TypeError as e:
    print(f"Tipo errado: {e}")
except KeyError as e:
    print(f"Chave não encontrada: {e}")
except Exception as e:
    print(f"Erro inesperado: {e}")
    raise  # Re-lança para debug
#+END_SRC

** Criando Exceções Customizadas

#+BEGIN_SRC python
class ErroAgente(Exception):
    """Exceção base para erros de agente."""
    pass

class ErroFerramentaNaoEncontrada(ErroAgente):
    """Ferramenta solicitada não existe."""
    pass

class ErroLimiteTokens(ErroAgente):
    """Limite de tokens excedido."""
    pass


class AgenteSeguro:
    def usar_ferramenta(self, nome: str):
        if nome not in self.ferramentas:
            raise ErroFerramentaNaoEncontrada(f"Ferramenta '{nome}' não registrada")
        # ... resto da lógica
#+END_SRC

** Context Managers

Padrão para gerenciar recursos automaticamente.

#+BEGIN_SRC python
from contextlib import contextmanager

@contextmanager
def agente_contexto(nome: str):
    """Context manager para agente com cleanup automático."""
    agente = Agente(nome)
    print(f"[{nome}] Iniciando sessão...")
    try:
        yield agente
    finally:
        print(f"[{nome}] Encerrando sessão...")
        agente.limpar_memoria()

# Uso
with agente_contexto("TestBot") as agente:
    agente.conversar("Olá!")
    # Automaticamente faz cleanup ao sair
#+END_SRC

* Organização de Código

