pages/guilda-ia/_arquivadas/03b-python-intermediario.html
<div id="outline-container-orga6431f3" class="outline-3">
<h3 id="orga6431f3">Herança</h3>
<div class="outline-text-3" id="text-orga6431f3">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">AgenteComFerramentas</span>(Agente):
    <span class="org-doc">"""Agente que pode usar ferramentas externas."""</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, nome: <span class="org-builtin">str</span>, sistema: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">"Voc&#234; &#233; um assistente."</span>, ferramentas: <span class="org-builtin">dict</span> <span class="org-operator">=</span> <span class="org-constant">None</span>):
        <span class="org-builtin">super</span>().__init__(nome, sistema)
        <span class="org-keyword">self</span>.<span class="org-variable-name">ferramentas</span> <span class="org-operator">=</span> ferramentas <span class="org-keyword">or</span> {}

    <span class="org-keyword">def</span> <span class="org-function-name">adicionar_ferramenta</span>(<span class="org-keyword">self</span>, nome: <span class="org-builtin">str</span>, funcao: <span class="org-builtin">callable</span>) <span class="org-operator">-&gt;</span> <span class="org-constant">None</span>:
        <span class="org-doc">"""Registra uma nova ferramenta."""</span>
        <span class="org-keyword">self</span>.<span class="org-variable-name">ferramentas</span>[nome] <span class="org-operator">=</span> funcao

    <span class="org-keyword">def</span> <span class="org-function-name">usar_ferramenta</span>(<span class="org-keyword">self</span>, nome: <span class="org-builtin">str</span>, <span class="org-operator">*</span>args, <span class="org-operator">**</span>kwargs):
        <span class="org-doc">"""Executa uma ferramenta pelo nome."""</span>
        <span class="org-keyword">if</span> nome <span class="org-keyword">not</span> <span class="org-keyword">in</span> <span class="org-keyword">self</span>.ferramentas:
            <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>(f<span class="org-string">"Ferramenta '</span>{nome}<span class="org-string">' n&#227;o encontrada"</span>)
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.ferramentas[nome](<span class="org-operator">*</span>args, <span class="org-operator">**</span>kwargs)


<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-keyword">def</span> <span class="org-function-name">calculadora</span>(expr: <span class="org-builtin">str</span>):
    <span class="org-keyword">return</span> <span class="org-builtin">eval</span>(expr)  <span class="org-comment-delimiter"># </span><span class="org-comment">Simplificado - n&#227;o usar em produ&#231;&#227;o!
</span>
<span class="org-variable-name">agente</span> <span class="org-operator">=</span> AgenteComFerramentas(<span class="org-string">"Calc"</span>, ferramentas<span class="org-operator">=</span>{<span class="org-string">"calc"</span>: calculadora})
<span class="org-builtin">print</span>(agente.usar_ferramenta(<span class="org-string">"calc"</span>, <span class="org-string">"2 + 2"</span>))  <span class="org-comment-delimiter"># </span><span class="org-comment">4</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e6078c" class="outline-3">
<h3 id="org1e6078c">@property e Encapsulamento</h3>
<div class="outline-text-3" id="text-org1e6078c">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">AgenteProtegido</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, nome: <span class="org-builtin">str</span>):
        <span class="org-keyword">self</span>.<span class="org-variable-name">_nome</span> <span class="org-operator">=</span> nome  <span class="org-comment-delimiter"># </span><span class="org-comment">"Privado" por conven&#231;&#227;o
</span>        <span class="org-keyword">self</span>.<span class="org-variable-name">__historico</span> <span class="org-operator">=</span> []  <span class="org-comment-delimiter"># </span><span class="org-comment">Name-mangled (mais privado)
</span>
    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">nome</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
        <span class="org-doc">"""Getter para nome."""</span>
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>._nome

    <span class="org-type">@nome.setter</span>
    <span class="org-keyword">def</span> <span class="org-function-name">nome</span>(<span class="org-keyword">self</span>, valor: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-constant">None</span>:
        <span class="org-doc">"""Setter com valida&#231;&#227;o."""</span>
        <span class="org-keyword">if</span> <span class="org-keyword">not</span> valor.strip():
            <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>(<span class="org-string">"Nome n&#227;o pode ser vazio"</span>)
        <span class="org-keyword">self</span>.<span class="org-variable-name">_nome</span> <span class="org-operator">=</span> valor

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">total_mensagens</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
        <span class="org-doc">"""Propriedade calculada."""</span>
        <span class="org-keyword">return</span> <span class="org-builtin">len</span>(<span class="org-keyword">self</span>.__historico)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0ec22a5" class="outline-2">
<h2 id="org0ec22a5">Tratamento de Erros Robusto</h2>
<div class="outline-text-2" id="text-org0ec22a5">
</div>
<div id="outline-container-org9fa2f09" class="outline-3">
<h3 id="org9fa2f09">Hierarquia de Exceções</h3>
<div class="outline-text-3" id="text-org9fa2f09">
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Exce&#231;&#245;es embutidas comuns
</span><span class="org-keyword">try</span>:
    <span class="org-variable-name">resultado</span> <span class="org-operator">=</span> fazer_algo()
<span class="org-keyword">except</span> <span class="org-type">ValueError</span> <span class="org-keyword">as</span> e:
    <span class="org-builtin">print</span>(f<span class="org-string">"Valor inv&#225;lido: </span>{e}<span class="org-string">"</span>)
<span class="org-keyword">except</span> <span class="org-type">TypeError</span> <span class="org-keyword">as</span> e:
    <span class="org-builtin">print</span>(f<span class="org-string">"Tipo errado: </span>{e}<span class="org-string">"</span>)
<span class="org-keyword">except</span> <span class="org-type">KeyError</span> <span class="org-keyword">as</span> e:
    <span class="org-builtin">print</span>(f<span class="org-string">"Chave n&#227;o encontrada: </span>{e}<span class="org-string">"</span>)
<span class="org-keyword">except</span> <span class="org-type">Exception</span> <span class="org-keyword">as</span> e:
    <span class="org-builtin">print</span>(f<span class="org-string">"Erro inesperado: </span>{e}<span class="org-string">"</span>)
    <span class="org-keyword">raise</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">Re-lan&#231;a para debug</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd97db4" class="outline-3">
<h3 id="orgdd97db4">Criando Exceções Customizadas</h3>
<div class="outline-text-3" id="text-orgdd97db4">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">ErroAgente</span>(<span class="org-type">Exception</span>):
    <span class="org-doc">"""Exce&#231;&#227;o base para erros de agente."""</span>
    <span class="org-keyword">pass</span>

<span class="org-keyword">class</span> <span class="org-type">ErroFerramentaNaoEncontrada</span>(ErroAgente):
    <span class="org-doc">"""Ferramenta solicitada n&#227;o existe."""</span>
    <span class="org-keyword">pass</span>

<span class="org-keyword">class</span> <span class="org-type">ErroLimiteTokens</span>(ErroAgente):
    <span class="org-doc">"""Limite de tokens excedido."""</span>
    <span class="org-keyword">pass</span>


<span class="org-keyword">class</span> <span class="org-type">AgenteSeguro</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">usar_ferramenta</span>(<span class="org-keyword">self</span>, nome: <span class="org-builtin">str</span>):
        <span class="org-keyword">if</span> nome <span class="org-keyword">not</span> <span class="org-keyword">in</span> <span class="org-keyword">self</span>.ferramentas:
            <span class="org-keyword">raise</span> ErroFerramentaNaoEncontrada(f<span class="org-string">"Ferramenta '</span>{nome}<span class="org-string">' n&#227;o registrada"</span>)
        <span class="org-comment-delimiter"># </span><span class="org-comment">... resto da l&#243;gica</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2dd1252" class="outline-3">
<h3 id="org2dd1252">Context Managers</h3>
<div class="outline-text-3" id="text-org2dd1252">
<p>
Padrão para gerenciar recursos automaticamente.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> contextlib <span class="org-keyword">import</span> contextmanager

<span class="org-type">@contextmanager</span>
<span class="org-keyword">def</span> <span class="org-function-name">agente_contexto</span>(nome: <span class="org-builtin">str</span>):
    <span class="org-doc">"""Context manager para agente com cleanup autom&#225;tico."""</span>
    <span class="org-variable-name">agente</span> <span class="org-operator">=</span> Agente(nome)
    <span class="org-builtin">print</span>(f<span class="org-string">"[</span>{nome}<span class="org-string">] Iniciando sess&#227;o..."</span>)
    <span class="org-keyword">try</span>:
        <span class="org-keyword">yield</span> agente
    <span class="org-keyword">finally</span>:
        <span class="org-builtin">print</span>(f<span class="org-string">"[</span>{nome}<span class="org-string">] Encerrando sess&#227;o..."</span>)
        agente.limpar_memoria()

<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-keyword">with</span> agente_contexto(<span class="org-string">"TestBot"</span>) <span class="org-keyword">as</span> agente:
    agente.conversar(<span class="org-string">"Ol&#225;!"</span>)
    <span class="org-comment-delimiter"># </span><span class="org-comment">Automaticamente faz cleanup ao sair</span>
</pre>
</div>
</div>
</div>
</div>
