src/pages/guilda-ia/_arquivadas/03b-python-intermediario.org
** Type Hints

Documentação de tipos para melhor legibilidade e debug.

#+BEGIN_SRC python
from typing import List, Dict, Optional, Union, Callable

def processar_mensagens(
    mensagens: List[Dict[str, str]],
    max_tokens: int = 1000,
    modelo: str = "gpt-4o-mini"
) -> Dict[str, Union[str, int]]:
    """
    Processa uma lista de mensagens.
    
    Args:
        mensagens: Lista de mensagens no formato OpenAI
        max_tokens: Máximo de tokens na resposta
        modelo: ID do modelo a usar
    
    Returns:
        Dicionário com resposta e metadados
    """
    # ...
    return {"resposta": "...", "tokens_usados": 150}


def buscar_ferramenta(
    nome: str,
    registro: Dict[str, Callable]
) -> Optional[Callable]:
    """Busca uma ferramenta pelo nome. Retorna None se não encontrar."""
    return registro.get(nome)
#+END_SRC

** Dataclasses

Classes focadas em dados com menos boilerplate.

#+BEGIN_SRC python
from dataclasses import dataclass, field
from typing import List, Dict

@dataclass
class Mensagem:
    role: str
    content: str
    
    def to_dict(self) -> Dict[str, str]:
        return {"role": self.role, "content": self.content}

@dataclass
class AgenteConfig:
    nome: str
    sistema: str = "Você é um assistente."
    max_historico: int = 20
    ferramentas: List[str] = field(default_factory=list)
    
    def __post_init__(self):
        """Validação após inicialização."""
        if not self.nome.strip():
            raise ValueError("Nome não pode ser vazio")


# Uso
msg = Mensagem(role="user", content="Olá!")
config = AgenteConfig("Bot", ferramentas=["calc", "wiki"])
print(config)  # AgenteConfig(nome='Bot', sistema='...', max_historico=20, ferramentas=['calc', 'wiki'])
#+END_SRC

** Modularização

Estrutura recomendada para projetos maiores:

#+BEGIN_SRC text
meu_agente/
├── __init__.py
├── agente.py          # Classe principal Agente
├── ferramentas/
│   ├── __init__.py
│   ├── calculadora.py
│   ├── wikipedia.py
│   └── horario.py
├── memoria.py         # Gerenciamento de histórico
├── config.py          # Configurações centralizadas
└── main.py            # Ponto de entrada
#+END_SRC

* Padrões Úteis para Agentes

** Singleton para Memória Compartilhada

#+BEGIN_SRC python
class MemoriaGlobal:
    _instancia = None
    
    def __new__(cls):
        if cls._instancia is None:
            cls._instancia = super().__new__(cls)
            cls._instancia._dados = {}
        return cls._instancia
    
    def salvar(self, chave: str, valor: any) -> None:
        self._dados[chave] = valor
    
    def recuperar(self, chave: str) -> any:
        return self._dados.get(chave)

# Uso
mem1 = MemoriaGlobal()
mem2 = MemoriaGlobal()
mem1.salvar("teste", 123)
print(mem2.recuperar("teste"))  # 123 - mesma instância!
#+END_SRC

** Factory Pattern para Agentes

#+BEGIN_SRC python
class AgenteFactory:
    """Factory para criar diferentes tipos de agentes."""
    
    @staticmethod
    def criar_assistente() -> AgenteComFerramentas:
        return AgenteComFerramentas(
            nome="Assistente",
            sistema="Você é um assistente útil e educado.",
            ferramentas={"calc": calculadora, "horario": obter_horario}
        )
    
    @staticmethod
    def criar_tutor_python() -> AgenteComFerramentas:
        return AgenteComFerramentas(
            nome="TutorPython",
            sistema="Você é um professor de Python paciente e didático.",
            ferramentas={"calc": calculadora}
        )
    
    @staticmethod
    def criar_do_tipo(tipo: str) -> AgenteComFerramentas:
        """Cria agente baseado em string."""
        criadores = {
            "assistente": AgenteFactory.criar_assistente,
            "tutor_python": AgenteFactory.criar_tutor_python,
        }
        if tipo not in criadores:
            raise ValueError(f"Tipo de agente desconhecido: {tipo}")
        return criadores[tipo]()

# Uso
agente = AgenteFactory.criar_do_tipo("tutor_python")
#+END_SRC

