pages/guilda-ia/_arquivadas/03b-python-intermediario.html
<div id="outline-container-orgcc604fe" class="outline-2">
<h2 id="orgcc604fe">Organização de Código</h2>
<div class="outline-text-2" id="text-orgcc604fe">
</div>
<div id="outline-container-orgf69e13f" class="outline-3">
<h3 id="orgf69e13f">Type Hints</h3>
<div class="outline-text-3" id="text-orgf69e13f">
<p>
Documentação de tipos para melhor legibilidade e debug.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> typing <span class="org-keyword">import</span> List, Dict, Optional, Union, Callable

<span class="org-keyword">def</span> <span class="org-function-name">processar_mensagens</span>(
    mensagens: List[Dict[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>]],
    max_tokens: <span class="org-builtin">int</span> <span class="org-operator">=</span> 1000,
    modelo: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">"gpt-4o-mini"</span>
) <span class="org-operator">-&gt;</span> Dict[<span class="org-builtin">str</span>, Union[<span class="org-builtin">str</span>, <span class="org-builtin">int</span>]]:
    <span class="org-doc">"""
    Processa uma lista de mensagens.

    Args:
        mensagens: Lista de mensagens no formato OpenAI
        max_tokens: M&#225;ximo de tokens na resposta
        modelo: ID do modelo a usar

    Returns:
        Dicion&#225;rio com resposta e metadados
    """</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">...
</span>    <span class="org-keyword">return</span> {<span class="org-string">"resposta"</span>: <span class="org-string">"..."</span>, <span class="org-string">"tokens_usados"</span>: 150}


<span class="org-keyword">def</span> <span class="org-function-name">buscar_ferramenta</span>(
    nome: <span class="org-builtin">str</span>,
    registro: Dict[<span class="org-builtin">str</span>, Callable]
) <span class="org-operator">-&gt;</span> Optional[Callable]:
    <span class="org-doc">"""Busca uma ferramenta pelo nome. Retorna None se n&#227;o encontrar."""</span>
    <span class="org-keyword">return</span> registro.get(nome)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8cd400" class="outline-3">
<h3 id="orgf8cd400">Dataclasses</h3>
<div class="outline-text-3" id="text-orgf8cd400">
<p>
Classes focadas em dados com menos boilerplate.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> dataclasses <span class="org-keyword">import</span> dataclass, field
<span class="org-keyword">from</span> typing <span class="org-keyword">import</span> List, Dict

<span class="org-type">@dataclass</span>
<span class="org-keyword">class</span> <span class="org-type">Mensagem</span>:
    role: <span class="org-builtin">str</span>
    content: <span class="org-builtin">str</span>

    <span class="org-keyword">def</span> <span class="org-function-name">to_dict</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> Dict[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>]:
        <span class="org-keyword">return</span> {<span class="org-string">"role"</span>: <span class="org-keyword">self</span>.role, <span class="org-string">"content"</span>: <span class="org-keyword">self</span>.content}

<span class="org-type">@dataclass</span>
<span class="org-keyword">class</span> <span class="org-type">AgenteConfig</span>:
    nome: <span class="org-builtin">str</span>
    <span class="org-variable-name">sistema</span>: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">"Voc&#234; &#233; um assistente."</span>
    <span class="org-variable-name">max_historico</span>: <span class="org-builtin">int</span> <span class="org-operator">=</span> 20
    <span class="org-variable-name">ferramentas</span>: <span class="org-type">List</span>[<span class="org-builtin">str</span>] <span class="org-operator">=</span> field(default_factory<span class="org-operator">=</span><span class="org-builtin">list</span>)

    <span class="org-keyword">def</span> <span class="org-function-name">__post_init__</span>(<span class="org-keyword">self</span>):
        <span class="org-doc">"""Valida&#231;&#227;o ap&#243;s inicializa&#231;&#227;o."""</span>
        <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-keyword">self</span>.nome.strip():
            <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>(<span class="org-string">"Nome n&#227;o pode ser vazio"</span>)


<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-variable-name">msg</span> <span class="org-operator">=</span> Mensagem(role<span class="org-operator">=</span><span class="org-string">"user"</span>, content<span class="org-operator">=</span><span class="org-string">"Ol&#225;!"</span>)
<span class="org-variable-name">config</span> <span class="org-operator">=</span> AgenteConfig(<span class="org-string">"Bot"</span>, ferramentas<span class="org-operator">=</span>[<span class="org-string">"calc"</span>, <span class="org-string">"wiki"</span>])
<span class="org-builtin">print</span>(config)  <span class="org-comment-delimiter"># </span><span class="org-comment">AgenteConfig(nome='Bot', sistema='...', max_historico=20, ferramentas=['calc', 'wiki'])</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa522d5" class="outline-3">
<h3 id="orgaa522d5">Modularização</h3>
<div class="outline-text-3" id="text-orgaa522d5">
<p>
Estrutura recomendada para projetos maiores:
</p>

<div class="org-src-container">
<pre class="src src-text">meu_agente/
&#9500;&#9472;&#9472; __init__.py
&#9500;&#9472;&#9472; agente.py          # Classe principal Agente
&#9500;&#9472;&#9472; ferramentas/
&#9474;   &#9500;&#9472;&#9472; __init__.py
&#9474;   &#9500;&#9472;&#9472; calculadora.py
&#9474;   &#9500;&#9472;&#9472; wikipedia.py
&#9474;   &#9492;&#9472;&#9472; horario.py
&#9500;&#9472;&#9472; memoria.py         # Gerenciamento de hist&#243;rico
&#9500;&#9472;&#9472; config.py          # Configura&#231;&#245;es centralizadas
&#9492;&#9472;&#9472; main.py            # Ponto de entrada
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1a3c385" class="outline-2">
<h2 id="org1a3c385">Padrões Úteis para Agentes</h2>
<div class="outline-text-2" id="text-org1a3c385">
</div>
<div id="outline-container-org7c5fa08" class="outline-3">
<h3 id="org7c5fa08">Singleton para Memória Compartilhada</h3>
<div class="outline-text-3" id="text-org7c5fa08">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">MemoriaGlobal</span>:
    <span class="org-variable-name">_instancia</span> <span class="org-operator">=</span> <span class="org-constant">None</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__new__</span>(cls):
        <span class="org-keyword">if</span> cls._instancia <span class="org-keyword">is</span> <span class="org-constant">None</span>:
            cls.<span class="org-variable-name">_instancia</span> <span class="org-operator">=</span> <span class="org-builtin">super</span>().__new__(cls)
            cls._instancia.<span class="org-variable-name">_dados</span> <span class="org-operator">=</span> {}
        <span class="org-keyword">return</span> cls._instancia

    <span class="org-keyword">def</span> <span class="org-function-name">salvar</span>(<span class="org-keyword">self</span>, chave: <span class="org-builtin">str</span>, valor: <span class="org-builtin">any</span>) <span class="org-operator">-&gt;</span> <span class="org-constant">None</span>:
        <span class="org-keyword">self</span>.<span class="org-variable-name">_dados</span>[chave] <span class="org-operator">=</span> valor

    <span class="org-keyword">def</span> <span class="org-function-name">recuperar</span>(<span class="org-keyword">self</span>, chave: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">any</span>:
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>._dados.get(chave)

<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-variable-name">mem1</span> <span class="org-operator">=</span> MemoriaGlobal()
<span class="org-variable-name">mem2</span> <span class="org-operator">=</span> MemoriaGlobal()
mem1.salvar(<span class="org-string">"teste"</span>, 123)
<span class="org-builtin">print</span>(mem2.recuperar(<span class="org-string">"teste"</span>))  <span class="org-comment-delimiter"># </span><span class="org-comment">123 - mesma inst&#226;ncia!</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8b70892" class="outline-3">
<h3 id="org8b70892">Factory Pattern para Agentes</h3>
<div class="outline-text-3" id="text-org8b70892">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">AgenteFactory</span>:
    <span class="org-doc">"""Factory para criar diferentes tipos de agentes."""</span>

    @<span class="org-builtin">staticmethod</span>
    <span class="org-keyword">def</span> <span class="org-function-name">criar_assistente</span>() <span class="org-operator">-&gt;</span> AgenteComFerramentas:
        <span class="org-keyword">return</span> AgenteComFerramentas(
            nome<span class="org-operator">=</span><span class="org-string">"Assistente"</span>,
            sistema<span class="org-operator">=</span><span class="org-string">"Voc&#234; &#233; um assistente &#250;til e educado."</span>,
            ferramentas<span class="org-operator">=</span>{<span class="org-string">"calc"</span>: calculadora, <span class="org-string">"horario"</span>: obter_horario}
        )

    @<span class="org-builtin">staticmethod</span>
    <span class="org-keyword">def</span> <span class="org-function-name">criar_tutor_python</span>() <span class="org-operator">-&gt;</span> AgenteComFerramentas:
        <span class="org-keyword">return</span> AgenteComFerramentas(
            nome<span class="org-operator">=</span><span class="org-string">"TutorPython"</span>,
            sistema<span class="org-operator">=</span><span class="org-string">"Voc&#234; &#233; um professor de Python paciente e did&#225;tico."</span>,
            ferramentas<span class="org-operator">=</span>{<span class="org-string">"calc"</span>: calculadora}
        )

    @<span class="org-builtin">staticmethod</span>
    <span class="org-keyword">def</span> <span class="org-function-name">criar_do_tipo</span>(tipo: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> AgenteComFerramentas:
        <span class="org-doc">"""Cria agente baseado em string."""</span>
        <span class="org-variable-name">criadores</span> <span class="org-operator">=</span> {
            <span class="org-string">"assistente"</span>: AgenteFactory.criar_assistente,
            <span class="org-string">"tutor_python"</span>: AgenteFactory.criar_tutor_python,
        }
        <span class="org-keyword">if</span> tipo <span class="org-keyword">not</span> <span class="org-keyword">in</span> criadores:
            <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>(f<span class="org-string">"Tipo de agente desconhecido: </span>{tipo}<span class="org-string">"</span>)
        <span class="org-keyword">return</span> criadores[tipo]()

<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-variable-name">agente</span> <span class="org-operator">=</span> AgenteFactory.criar_do_tipo(<span class="org-string">"tutor_python"</span>)
</pre>
</div>
</div>
</div>
</div>
