src/pages/guilda-ia/_arquivadas/03b-python-intermediario.org
* Exercícios Práticos

** Exercício 1: Agente com Config

Crie uma classe AgenteConfiguravel que aceita configurações via dataclass:

#+BEGIN_SRC python
@dataclass
class Config:
    nome: str
    sistema: str
    max_tokens: int = 1000
    temperatura: float = 0.7

class AgenteConfiguravel:
    def __init__(self, config: Config):
        # Implemente
        pass
    
    def conversar(self, mensagem: str) -> str:
        # Implemente
        pass
#+END_SRC

#+BEGIN_DETAILS
📝 Gabarito

#+BEGIN_SRC python
from dataclasses import dataclass

@dataclass
class Config:
    nome: str
    sistema: str
    max_tokens: int = 1000
    temperatura: float = 0.7

class AgenteConfiguravel:
    def __init__(self, config: Config):
        if not config.nome.strip():
            raise ValueError("Nome não pode ser vazio")
        self.config = config
        self.historico: list = []
    
    def conversar(self, mensagem: str) -> str:
        self.historico.append({"role": "user", "content": mensagem})
        resposta = f"[{self.config.nome}] Processando com temp={self.config.temperatura}"
        self.historico.append({"role": "assistant", "content": resposta})
        return resposta
    
    @property
    def total_mensagens(self) -> int:
        return len(self.historico)

# Uso
config = Config(nome="TestBot", sistema="Seja útil.", temperatura=0.5)
agente = AgenteConfiguravel(config)
print(agente.conversar("Olá!"))
#+END_SRC

#+END_DETAILS

** Exercício 2: Repository Pattern para Histórico

Implemente um RepositorioHistorico que salva/recupera mensagens:

#+BEGIN_DETAILS
📝 Gabarito

#+BEGIN_SRC python
import json
from pathlib import Path
from typing import List, Dict

class RepositorioHistorico:
    def __init__(self, arquivo: str = "historico.json"):
        self.arquivo = Path(arquivo)
    
    def salvar(self, mensagens: List[Dict[str, str]]) -> None:
        with open(self.arquivo, 'w', encoding='utf-8') as f:
            json.dump(mensagens, f, ensure_ascii=False, indent=2)
    
    def carregar(self) -> List[Dict[str, str]]:
        if not self.arquivo.exists():
            return []
        with open(self.arquivo, 'r', encoding='utf-8') as f:
            return json.load(f)
    
    def limpar(self) -> None:
        if self.arquivo.exists():
            self.arquivo.unlink()

# Uso
repo = RepositorioHistorico()
repo.salvar([{"role": "user", "content": "Olá"}])
mensagens = repo.carregar()
print(mensagens)
#+END_SRC

#+END_DETAILS

* Próxima Semana

**Estrutura de Agente:** Vamos aprender a montar a arquitetura completa de um agente, conectando LLM, memória e ferramentas.