pages/guilda-ia/_arquivadas/03b-python-intermediario.html
<div id="outline-container-orgce75baa" class="outline-2">
<h2 id="orgce75baa">Exercícios Práticos</h2>
<div class="outline-text-2" id="text-orgce75baa">
</div>
<div id="outline-container-org497b004" class="outline-3">
<h3 id="org497b004">Exercício 1: Agente com Config</h3>
<div class="outline-text-3" id="text-org497b004">
<p>
Crie uma classe AgenteConfiguravel que aceita configurações via dataclass:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-type">@dataclass</span>
<span class="org-keyword">class</span> <span class="org-type">Config</span>:
    nome: <span class="org-builtin">str</span>
    sistema: <span class="org-builtin">str</span>
    <span class="org-variable-name">max_tokens</span>: <span class="org-builtin">int</span> <span class="org-operator">=</span> 1000
    <span class="org-variable-name">temperatura</span>: <span class="org-builtin">float</span> <span class="org-operator">=</span> 0.7

<span class="org-keyword">class</span> <span class="org-type">AgenteConfiguravel</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, config: Config):
        <span class="org-comment-delimiter"># </span><span class="org-comment">Implemente
</span>        <span class="org-keyword">pass</span>

    <span class="org-keyword">def</span> <span class="org-function-name">conversar</span>(<span class="org-keyword">self</span>, mensagem: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
        <span class="org-comment-delimiter"># </span><span class="org-comment">Implemente
</span>        <span class="org-keyword">pass</span>
</pre>
</div>

<div class="DETAILS" id="orgc4c36c5">
<p>
📝 Gabarito
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> dataclasses <span class="org-keyword">import</span> dataclass

<span class="org-type">@dataclass</span>
<span class="org-keyword">class</span> <span class="org-type">Config</span>:
    nome: <span class="org-builtin">str</span>
    sistema: <span class="org-builtin">str</span>
    <span class="org-variable-name">max_tokens</span>: <span class="org-builtin">int</span> <span class="org-operator">=</span> 1000
    <span class="org-variable-name">temperatura</span>: <span class="org-builtin">float</span> <span class="org-operator">=</span> 0.7

<span class="org-keyword">class</span> <span class="org-type">AgenteConfiguravel</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, config: Config):
        <span class="org-keyword">if</span> <span class="org-keyword">not</span> config.nome.strip():
            <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>(<span class="org-string">"Nome n&#227;o pode ser vazio"</span>)
        <span class="org-keyword">self</span>.<span class="org-variable-name">config</span> <span class="org-operator">=</span> config
        <span class="org-keyword">self</span>.<span class="org-variable-name">historico</span>: <span class="org-builtin">list</span> <span class="org-operator">=</span> []

    <span class="org-keyword">def</span> <span class="org-function-name">conversar</span>(<span class="org-keyword">self</span>, mensagem: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
        <span class="org-keyword">self</span>.historico.append({<span class="org-string">"role"</span>: <span class="org-string">"user"</span>, <span class="org-string">"content"</span>: mensagem})
        <span class="org-variable-name">resposta</span> <span class="org-operator">=</span> f<span class="org-string">"[</span>{<span class="org-keyword">self</span>.config.nome}<span class="org-string">] Processando com temp=</span>{<span class="org-keyword">self</span>.config.temperatura}<span class="org-string">"</span>
        <span class="org-keyword">self</span>.historico.append({<span class="org-string">"role"</span>: <span class="org-string">"assistant"</span>, <span class="org-string">"content"</span>: resposta})
        <span class="org-keyword">return</span> resposta

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">total_mensagens</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
        <span class="org-keyword">return</span> <span class="org-builtin">len</span>(<span class="org-keyword">self</span>.historico)

<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-variable-name">config</span> <span class="org-operator">=</span> Config(nome<span class="org-operator">=</span><span class="org-string">"TestBot"</span>, sistema<span class="org-operator">=</span><span class="org-string">"Seja &#250;til."</span>, temperatura<span class="org-operator">=</span>0.5)
<span class="org-variable-name">agente</span> <span class="org-operator">=</span> AgenteConfiguravel(config)
<span class="org-builtin">print</span>(agente.conversar(<span class="org-string">"Ol&#225;!"</span>))
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org828511a" class="outline-3">
<h3 id="org828511a">Exercício 2: Repository Pattern para Histórico</h3>
<div class="outline-text-3" id="text-org828511a">
<p>
Implemente um RepositorioHistorico que salva/recupera mensagens:
</p>

<div class="DETAILS" id="org7e0e742">
<p>
📝 Gabarito
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> json
<span class="org-keyword">from</span> pathlib <span class="org-keyword">import</span> Path
<span class="org-keyword">from</span> typing <span class="org-keyword">import</span> List, Dict

<span class="org-keyword">class</span> <span class="org-type">RepositorioHistorico</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, arquivo: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">"historico.json"</span>):
        <span class="org-keyword">self</span>.<span class="org-variable-name">arquivo</span> <span class="org-operator">=</span> Path(arquivo)

    <span class="org-keyword">def</span> <span class="org-function-name">salvar</span>(<span class="org-keyword">self</span>, mensagens: List[Dict[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>]]) <span class="org-operator">-&gt;</span> <span class="org-constant">None</span>:
        <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-keyword">self</span>.arquivo, <span class="org-string">'w'</span>, encoding<span class="org-operator">=</span><span class="org-string">'utf-8'</span>) <span class="org-keyword">as</span> f:
            json.dump(mensagens, f, ensure_ascii<span class="org-operator">=</span><span class="org-constant">False</span>, indent<span class="org-operator">=</span>2)

    <span class="org-keyword">def</span> <span class="org-function-name">carregar</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> List[Dict[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>]]:
        <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-keyword">self</span>.arquivo.exists():
            <span class="org-keyword">return</span> []
        <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-keyword">self</span>.arquivo, <span class="org-string">'r'</span>, encoding<span class="org-operator">=</span><span class="org-string">'utf-8'</span>) <span class="org-keyword">as</span> f:
            <span class="org-keyword">return</span> json.load(f)

    <span class="org-keyword">def</span> <span class="org-function-name">limpar</span>(<span class="org-keyword">self</span>) <span class="org-operator">-&gt;</span> <span class="org-constant">None</span>:
        <span class="org-keyword">if</span> <span class="org-keyword">self</span>.arquivo.exists():
            <span class="org-keyword">self</span>.arquivo.unlink()

<span class="org-comment-delimiter"># </span><span class="org-comment">Uso
</span><span class="org-variable-name">repo</span> <span class="org-operator">=</span> RepositorioHistorico()
repo.salvar([{<span class="org-string">"role"</span>: <span class="org-string">"user"</span>, <span class="org-string">"content"</span>: <span class="org-string">"Ol&#225;"</span>}])
<span class="org-variable-name">mensagens</span> <span class="org-operator">=</span> repo.carregar()
<span class="org-builtin">print</span>(mensagens)
</pre>
</div>

</div>
</div>
</div>
</div>
<div id="outline-container-org36ea5ff" class="outline-2">
<h2 id="org36ea5ff">Próxima Semana</h2>
<div class="outline-text-2" id="text-org36ea5ff">
<p>
<b><b>Estrutura de Agente:</b></b> Vamos aprender a montar a arquitetura completa de um agente, conectando LLM, memória e ferramentas.</p>
</div>
</div>
</div>
</body>
</html>
